SQL Basics - Assignment Questions

1. Create a table called employees with the following structure?
: emp_id (integer, should not be NULL and should be a primary key)Q
: emp_name (text, should not be NULL)Q
: age (integer, should have a check constraint to ensure the age is at least 18)Q
: email (text, should be unique for each employee)Q
: salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints

In [ ]:
CREATE TABLE employees (
    emp_id INT NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INT CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL(10,2) DEFAULT 30000
);

2. 2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints.

In [ ]:
Purpose of Constraints

Ensure Data Accuracy → prevent invalid values (e.g., negative age).

Maintain Uniqueness → stop duplicate records where uniqueness is required (e.g., email IDs).

Preserve Relationships → enforce valid connections between tables (e.g., foreign keys).

Provide Default Values → ensure missing data still has a sensible entry.

Improve Reliability → databases can trust their data without constant manual validation.

3. Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify
your answer.

In [ ]:
The NOT NULL constraint ensures that a column must always have a value—it cannot be left empty. It is applied when certain information is essential for each record.

Example:

emp_name TEXT NOT NULL;

→ Every employee must have a name. If someone tries to insert a record without emp_name, the database will reject it.

Purpose:

Guarantees important fields are always filled.

Prevents incomplete or meaningless data (e.g., an employee with no ID, name, or date of hire).

Helps maintain data accuracy and consistency.

Can a Primary Key contain NULL values?

No, a primary key cannot contain NULL values.

Justification:

A primary key uniquely identifies each row in a table.

If it allowed NULL, two or more rows could have NULL in the key column, which would break uniqueness because NULL represents an "unknown" value.

By definition, a primary key is a combination of NOT NULL and UNIQUE.

NOT NULL → ensures every record has a valid identifier.

UNIQUE → ensures no two records share the same identifier.

Example:

CREATE TABLE employees ( emp_id INT PRIMARY KEY, emp_name TEXT NOT NULL );

Here, emp_id cannot be NULL. Every employee must have a valid ID.

4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint.

In [ ]:
Steps to Add or Remove Constraints

Adding a Constraint
Use the ALTER TABLE statement with ADD CONSTRAINT.

You must give a name to the constraint when adding it, so it can be referenced later (especially for removal).

Syntax:

ALTER TABLE table_name ADD CONSTRAINT constraint_name constraint_type (column_name);

Example (Add UNIQUE constraint to email column):

ALTER TABLE employees ADD CONSTRAINT unique_email UNIQUE (email);

Here:

unique_email is the name of the new constraint.

Ensures no duplicate emails exist.

Removing (Dropping) a Constraint
Use the ALTER TABLE statement with DROP CONSTRAINT.

The exact syntax depends on the DBMS (PostgreSQL, MySQL, Oracle, SQL Server).

PostgreSQL / Oracle / SQL Server Syntax:

ALTER TABLE table_name DROP CONSTRAINT constraint_name;

MySQL Syntax:

For a PRIMARY KEY:

ALTER TABLE employees DROP PRIMARY KEY;

For a FOREIGN KEY:

ALTER TABLE employees DROP FOREIGN KEY fk_name;

For a UNIQUE or CHECK constraint:

ALTER TABLE employees DROP INDEX unique_email;

Example (Drop the UNIQUE constraint on email):

ALTER TABLE employees DROP CONSTRAINT unique_email; -- (PostgreSQL / SQL Server)

5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint.

In [ ]:
When an operation breaks a rule enforced by a constraint, the database rejects the operation and throws an error message. This ensures that only valid, consistent data is stored.

NOT NULL Violation
Issue: Trying to insert NULL into a column defined as NOT NULL.

Example:

INSERT INTO employees (emp_id, emp_name, age, email) VALUES (1, NULL, 25, 'a@example.com');

Result/Error:

ERROR: null value in column "emp_name" violates not-null constraint

PRIMARY KEY Violation
Issue: Inserting a duplicate value in the primary key column.

Example:

INSERT INTO employees (emp_id, emp_name, age, email) VALUES (1, 'John', 30, 'john@example.com');

-- Second insert with same emp_id INSERT INTO employees (emp_id, emp_name, age, email) VALUES (1, 'Alice', 28, 'alice@example.com');

Result/Error:

ERROR: duplicate key value violates unique constraint "employees_pkey"

UNIQUE Violation
Issue: Inserting duplicate values into a column with a UNIQUE constraint.

Example:

INSERT INTO employees (emp_id, emp_name, age, email) VALUES (2, 'Bob', 29, 'john@example.com'); -- Duplicate email

Result/Error:

ERROR: duplicate key value violates unique constraint "unique_email"

CHECK Constraint Violation
Issue: Inserting a value that does not satisfy the condition.

Example:

INSERT INTO employees (emp_id, emp_name, age, email) VALUES (3, 'Charlie', 16, 'charlie@example.com'); -- age < 18

Result/Error:

ERROR: new row for relation "employees" violates check constraint "check_age"

FOREIGN KEY Violation
Issue: Inserting a value in a column that references a non-existing row in another table.

Example: If dept_id in employees references departments(dept_id):

INSERT INTO employees (emp_id, emp_name, age, email, dept_id) VALUES (4, 'David', 35, 'david@example.com', 999); -- No such department

Result/Error:

ERROR: insert or update on table "employees" violates foreign key constraint "fk_dept" DETAIL: Key (dept_id)=(999) is not present in table "departments".

6. You created a products table without constraints as follows:

CREATE TABLE products (

    product_id INT,

    product_name VARCHAR(50),

    price DECIMAL(10, 2));
Now, you realise that?
: The product_id should be a primary keyQ
: The price should have a default value of 50.00

SQL Commands

1-Identify the primary keys and foreign keys in maven movies db. Discuss the differences

In [ ]:
Primary Keys in Maven Movies DB

A primary key (PK) uniquely identifies each row in a table. Examples from Maven Movies DB:

actor → actor_id

film → film_id

customer → customer_id

store → store_id

staff → staff_id

rental → rental_id

payment → payment_id

category → category_id

language → language_id

inventory → inventory_id

A foreign key (FK) links one table to another by referencing the primary key of the related table. Examples:

film → language_id references language(language_id)

inventory → film_id references film(film_id)

rental → inventory_id references inventory(inventory_id)

rental → customer_id references customer(customer_id)

rental → staff_id references staff(staff_id)

payment → rental_id references rental(rental_id)

payment → customer_id references customer(customer_id)

payment → staff_id references staff(staff_id)

film_category → film_id references film(film_id) and category_id references category(category_id)

film_actor → film_id references film(film_id) and actor_id references actor(actor_id)

2- List all details of actors

In [ ]:
In the Maven Movies DB, the actor table typically contains the following columns:

actor_id → Primary Key

first_name → Actor’s first name

last_name → Actor’s last name

last_update → Timestamp when the record was last updated

3 -List all customer information from DB.

In [ ]:
Typically, it includes:

customer_id → Primary Key

store_id → Store where the customer registered (FK to store)

first_name

last_name

email

address_id → FK to address table

active → Whether the customer is active (1/0)

create_date

last_update

4 -List different countries

In [ ]:
Columns in the country table

country_id → Primary Key

country → Name of the country

last_update → Timestamp of last modification SELECT DISTINCT country FROM country;

5 -Display all active customers.

In [ ]:
active = 1 → Active customer

active = 0 → Inactive customer

SELECT * FROM customer WHERE active = 1;

6 -List of all rental IDs for customer with ID 1

In [ ]:
SELECT rental_id
FROM rental
WHERE customer_id = 1;
SELECT rental_id, rental_date
FROM rental
WHERE customer_id = 1
ORDER BY rental_date;

7.  Display all the films whose rental duration is greater than 5.

In [ ]:
SELECT *
FROM film
WHERE rental_duration > 5;

8 - List the total number of films whose replacement cost is greater than $15 and less than $20.

In [ ]:
SELECT COUNT(*) AS total_films
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;

9 - Display the count of unique first names of actors.

In [ ]:
SELECT COUNT(DISTINCT first_name) AS unique_first_names
FROM actor;

10- Display the first 10 records from the customer table .

In [ ]:
SELECT *
FROM customer
LIMIT 10;

11 - Display the first 3 records from the customer table whose first name starts with ‘b’.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'b%'
LIMIT 3;

12 -Display the names of the first 5 movies which are rated as ‘G’.

In [ ]:
SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;

13-Find all customers whose first name starts with "a".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'a%';

14- Find all customers whose first name ends with "a".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%a';

15- Display the list of first 4 cities which start and end with ‘a’ .

In [ ]:
SELECT city
FROM city
WHERE city LIKE 'a%a'
LIMIT 4;

16- Find all customers whose first name have "NI" in any position.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%NI%';

17- Find all customers whose first name have "r" in the second position .

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '_r%';

18 - Find all customers whose first name starts with "a" and are at least 5 characters in length.

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'a%'
  AND LENGTH(first_name) >= 5;

19- Find all customers whose first name starts with "a" and ends with "o".

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'a%o';

20 - Get the films with pg and pg-13 rating using IN operator.

In [ ]:
SELECT *
FROM film
WHERE rating IN ('PG', 'PG-13');

21 - Get the films with length between 50 to 100 using between operator.

In [ ]:
SELECT *
FROM film
WHERE length BETWEEN 50 AND 100;

22 - Get the top 50 actors using limit operator.

In [ ]:
SELECT *
FROM actor
LIMIT 50;

23 - Get the distinct film ids from inventory table.

In [ ]:
SELECT DISTINCT film_id
FROM inventory;

Functions -Basic Aggregate Functions:

1. Retrieve the total number of rentals made in the Sakila database.

Hint: Use the COUNT() function.

In [ ]:
SELECT COUNT(*) AS total_rentals
FROM rental;

2. Find the average rental duration (in days) of movies rented from the Sakila database.

Hint: Utilize the AVG() function

In [ ]:
SELECT AVG(rental_duration) AS average_rental_duration
FROM film;

String Functions:

Question 3:

Display the first name and last name of customers in uppercase.

Hint: Use the UPPER () function.

In [ ]:
SELECT UPPER(first_name) AS first_name_upper,
       UPPER(last_name) AS last_name_upper
FROM customer;

Question 4:

Extract the month from the rental date and display it alongside the rental ID.

Hint: Employ the MONTH() function.

In [ ]:
SELECT rental_id,
       MONTH(rental_date) AS rental_month
FROM rental;

GROUP BY:


Question 5:

Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

Hint: Use COUNT () in conjunction with GROUP BY.

In [ ]:
SELECT customer_id,
       COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id
ORDER BY rental_count DESC;

Question 6:

Find the total revenue generated by each store.

Hint: Combine SUM() and GROUP BY.

In [ ]:
SELECT store_id,
       SUM(amount) AS total_revenue
FROM payment
GROUP BY store_id
ORDER BY total_revenue DESC;

Question 7:

Determine the total number of rentals for each category of movies.

Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUP BY

In [ ]:
SELECT c.name AS category_name,
       COUNT(r.rental_id) AS total_rentals
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.name
ORDER BY total_rentals DESC;

Question 8:

Find the average rental rate of movies in each language.

Hint: JOIN film and language tables, then use AVG () and GROUP BY.

In [ ]:
SELECT l.name AS language_name,
       AVG(f.rental_rate) AS average_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name
ORDER BY average_rental_rate DESC;

Joins
Questions 9 -

Display the title of the movie, customer s first name, and last name who rented it.

Hint: Use JOIN between the film, inventory, rental, and customer tables.

In [ ]:
SELECT f.title AS movie_title,
       c.first_name AS customer_first_name,
       c.last_name AS customer_last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN customer c ON r.customer_id = c.customer_id;

Question 10:

Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

Hint: Use JOIN between the film actor, film, and actor tables.

In [ ]:
SELECT a.first_name,
       a.last_name
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';

Question 11:

Retrieve the customer names along with the total amount they've spent on rentals.

Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

In [ ]:
SELECT CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
       SUM(p.amount) AS total_spent
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
JOIN payment p ON r.rental_id = p.rental_id
GROUP BY c.customer_id, customer_name
ORDER BY total_spent DESC;

Question 12:

List the titles of movies rented by each customer in a particular city (e.g., 'London').

Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

In [ ]:
SELECT CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
       GROUP_CONCAT(f.title ORDER BY f.title SEPARATOR ', ') AS rented_movies
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London'
GROUP BY c.customer_id, customer_name
ORDER BY customer_name;

Advanced Joins and GROUP BY:

Question 13:

Display the top 5 rented movies along with the number of times they've been rented.

Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.

In [ ]:
SELECT f.title AS movie_title,
       COUNT(r.rental_id) AS times_rented
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.film_id, f.title
ORDER BY times_rented DESC
LIMIT 5;

Question 14:

Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.

In [ ]:
SELECT c.customer_id,
       CONCAT(c.first_name, ' ', c.last_name) AS customer_name
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
WHERE i.store_id IN (1, 2)
GROUP BY c.customer_id, customer_name
HAVING COUNT(DISTINCT i.store_id) = 2;

Windows Function:

1. Rank the customers based on the total amount they've spent on rentals.

In [ ]:
SELECT CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
       SUM(p.amount) AS total_spent,
       RANK() OVER (ORDER BY SUM(p.amount) DESC) AS rank
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
JOIN payment p ON r.rental_id = p.rental_id
GROUP BY c.customer_id, customer_name
ORDER BY rank;

2. Calculate the cumulative revenue generated by each film over time.

In [ ]:
SELECT f.title AS film_title,
       r.rental_date,
       SUM(p.amount) OVER (
           PARTITION BY f.film_id
           ORDER BY r.rental_date
           ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
       ) AS cumulative_revenue
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN payment p ON r.rental_id = p.rental_id
ORDER BY f.title, r.rental_date;

3. Determine the average rental duration for each film, considering films with similar lengths.

In [ ]:
SELECT
    FLOOR(length / 10) * 10 AS length_range_start,
    FLOOR(length / 10) * 10 + 9 AS length_range_end,
    COUNT(*) AS num_films,
    AVG(rental_duration) AS avg_rental_duration
FROM film
GROUP BY length_range_start, length_range_end
ORDER BY length_range_start;

4. Identify the top 3 films in each category based on their rental counts.

In [ ]:
SELECT category_name,
       film_title,
       rental_count
FROM (
    SELECT c.name AS category_name,
           f.title AS film_title,
           COUNT(r.rental_id) AS rental_count,
           ROW_NUMBER() OVER (
               PARTITION BY c.category_id
               ORDER BY COUNT(r.rental_id) DESC
           ) AS rank_in_category
    FROM film f
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY c.category_id, c.name, f.film_id, f.title
) AS ranked_films
WHERE rank_in_category <= 3
ORDER BY category_name, rental_count DESC;

5. Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers.

In [ ]:
SELECT
    c.customer_id,
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    COUNT(r.rental_id) AS total_rentals,
    (COUNT(r.rental_id) - avg_rentals) AS difference_from_average
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
CROSS JOIN (
    SELECT AVG(rental_count) AS avg_rentals
    FROM (
        SELECT COUNT(rental_id) AS rental_count
        FROM rental
        GROUP BY customer_id
    ) AS sub
) AS avg_table
GROUP BY c.customer_id, customer_name, avg_rentals
ORDER BY difference_from_average DESC;

6. Find the monthly revenue trend for the entire rental store over time.

In [ ]:
SELECT DATE_FORMAT(payment_date, '%Y-%m') AS month,
       SUM(amount) AS total_revenue
FROM payment
GROUP BY month
ORDER BY month;

7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

In [ ]:
SELECT customer_id,
       CONCAT(first_name, ' ', last_name) AS customer_name,
       total_spent
FROM (
    SELECT c.customer_id,
           c.first_name,
           c.last_name,
           SUM(p.amount) AS total_spent,
           NTILE(5) OVER (ORDER BY SUM(p.amount) DESC) AS spending_quintile
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    JOIN payment p ON r.rental_id = p.rental_id
    GROUP BY c.customer_id, c.first_name, c.last_name
) AS ranked_customers
WHERE spending_quintile = 1
ORDER BY total_spent D_

8. Calculate the running total of rentals per category, ordered by rental count.

In [ ]:
SELECT category_name,
       rental_count,
       SUM(rental_count) OVER (ORDER BY rental_count DESC) AS running_total_rentals
FROM (
    SELECT c.name AS category_name,
           COUNT(r.rental_id) AS rental_count
    FROM category c
    JOIN film_category fc ON c.category_id = fc.category_id
    JOIN film f ON fc.film_id = f.film_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY c.category_id, c.name
) AS category_rentals
ORDER BY rental_count DESC;

9. Find the films that have been rented less than the average rental count for their respective categories.

In [ ]:
WITH category_avg AS (
    SELECT c.category_id,
           AVG(film_rentals.rental_count) AS avg_rentals
    FROM category c
    JOIN film_category fc ON c.category_id = fc.category_id
    JOIN (
        SELECT f.film_id, COUNT(r.rental_id) AS rental_count
        FROM film f
        JOIN inventory i ON f.film_id = i.film_id
        JOIN rental r ON i.inventory_id = r.inventory_id
        GROUP BY f.film_id
    ) AS film_rentals ON fc.film_id = film_rentals.film_id
    GROUP BY c.category_id
)
SELECT f.title AS film_title,
       c.name AS category_name,
       fr.rental_count
FROM (
    SELECT f.film_id, f.title, COUNT(r.rental_id) AS rental_count
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY f.film_id, f.title
) AS fr
JOIN film_category fc ON fr.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
JOIN category_avg ca ON c.category_id = ca.category_id
WHERE fr.rental_count < ca.avg_rentals
ORDER BY c.name, fr.rental_count;

10. Identify the top 5 months with the highest revenue and display the revenue generated in each month

In [ ]:
SELECT DATE_FORMAT(payment_date, '%Y-%m') AS month,
       SUM(amount) AS total_revenue
FROM payment
GROUP BY month
ORDER BY total_revenue DESC
LIMIT 5;